app/controllers/api/posts_controller.rb

  def index
    @posts = if params[:user_id]
      Post.where(user_id: params[:user_id])
    else
      Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["body", "Look at all these chicken"], ["created_at", "2024-01-17 21:57:03.537320"], ["updated_at", "2024-01-17 21:57:03.537320"]]