app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "username", "fname", "lname", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2024-01-12 22:06:57.850939"], ["id", 12]]
---
  def create
    @user = User.create(user_params)
    if @user.save!